Revit 2027 API
BasicFileInfo.CentralPath Property
 Returns the central model path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CentralPath { get; }
Public ReadOnly Property CentralPath As String
	Get
public:
property String^ CentralPath {
	String^ get ();
}
member CentralPath : string with get
Property Value
String
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace